In [1]:
import pandas as pd 
import numpy as np

In [4]:
df=pd.read_csv("ex.csv")

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   UserID          20 non-null     int64
 1   Name            19 non-null     object
 2   Age             17 non-null     object
 3   Email           19 non-null     object
 4   Country         19 non-null     object
 5   Signup_Date     19 non-null     object
 6   Total_Purchase  19 non-null     object
 7   Status          20 non-null     object
dtypes: int64(1), object(7)
memory usage: 1.4+ KB

In [19]:
# checking the column names and the first few rows of the DataFrame
print("Initial Shape:", df.shape)
df.head()

Initial Shape: (20, 8)

,UserID,Name,Age,Email,Country,Signup_Date,Total_Purchase,Status
0,101,Ahmed Ali,25,ahmed@gmail.com,Egypt,2023-01-15,$1200,Active
1,102,sara mohamed,twenty-two,sara@gmail.com,egypt,2023/02/20,850,active
2,103,John Smith,30,NaN,USA,15-03-2023,1,Inactive
3,104,Lina Hassan,NaN,lina@yahoo.com,Egypt,2023-04-10,$950,Active
4,105,Omar Adel,28,omar@outlook.com,NaN,2023-05-01,700,Active

In [20]:
df.columns = (
    df.columns
      .str.strip()# Remove leading and trailing whitespace
      .str.lower()# Convert to lowercase
      .str.replace(" ", "_")# Replace spaces with underscores
)

In [21]:
text_cols = df.select_dtypes(include="object").columns

for col in text_cols:
    df[col] = df[col].str.strip()# Remove leading and trailing whitespace

In [25]:
df = df.drop_duplicates()
df.head(10)

,userid,name,age,email,country,signup_date,total_purchase,status
0,101,Ahmed Ali,25,ahmed@gmail.com,Egypt,2023-01-15,$1200,Active
1,102,sara mohamed,twenty-two,sara@gmail.com,egypt,2023/02/20,850,active
2,103,John Smith,30,NaN,USA,15-03-2023,1,Inactive
3,104,Lina Hassan,NaN,lina@yahoo.com,Egypt,2023-04-10,$950,Active
4,105,Omar Adel,28,omar@outlook.com,NaN,2023-05-01,700,Active
5,106,Mona Samy,35,mona@gmail,UK,2023-06-12,£500,Inactive
6,107,Ahmed Ali,25,ahmed@gmail.com,Egypt,2023-01-15,$1200,Active
7,108,Ali Nasser,40,ali@yahoo.com,UAE,NaN,1500,ACTIVE
8,109,Noor,29,noor@gmail.com,Egypt,2023-08-05,NaN,Active
9,110,Khaled,NaN,khaled@gmail.com,Egypt,2023-09-10,900,Inactive

In [28]:
age_mapping = {
    "twenty-two": 22,
    "thirty-five": 35
}

df["age"] = df["age"].replace(age_mapping)
df["age"] = pd.to_numeric(df["age"], errors="coerce")

In [30]:
df.head(10)

,userid,name,age,email,country,signup_date,total_purchase,status
0,101,Ahmed Ali,25.0,ahmed@gmail.com,Egypt,2023-01-15,$1200,Active
1,102,sara mohamed,22.0,sara@gmail.com,egypt,2023/02/20,850,active
2,103,John Smith,30.0,NaN,USA,15-03-2023,1,Inactive
3,104,Lina Hassan,NaN,lina@yahoo.com,Egypt,2023-04-10,$950,Active
4,105,Omar Adel,28.0,omar@outlook.com,NaN,2023-05-01,700,Active
5,106,Mona Samy,35.0,mona@gmail,UK,2023-06-12,£500,Inactive
6,107,Ahmed Ali,25.0,ahmed@gmail.com,Egypt,2023-01-15,$1200,Active
7,108,Ali Nasser,40.0,ali@yahoo.com,UAE,NaN,1500,ACTIVE
8,109,Noor,29.0,noor@gmail.com,Egypt,2023-08-05,NaN,Active
9,110,Khaled,NaN,khaled@gmail.com,Egypt,2023-09-10,900,Inactive

In [ ]:
#Clean Total_Purchase column
df["total_purchase"] = (
    df["total_purchase"]
      .astype(str)
      .str.replace(r"[$£,]", "", regex=True)
      .replace("free", np.nan)
)

df["total_purchase"] = pd.to_numeric(df["total_purchase"], errors="coerce")

In [ ]:
df["signup_date"] = pd.to_datetime(
    df["signup_date"],
    errors="coerce",
    dayfirst=True
)

In [ ]:
# 9️⃣ Validate Email column
email_pattern = r"^[\w\.-]+@[\w\.-]+\.\w+$"

df["email_valid"] = df["email"].str.match(email_pattern, na=False)

In [ ]:
#  Handle missing values
df["age"] = df["age"].fillna(df["age"].median())
df["total_purchase"] = df["total_purchase"].fillna(0)
df["country"] = df["country"].fillna("Unknown")